[
    {
        "title": "GTA San Andreas Multiplayer Gamemode",
        "date": "Mar 2023 - Apr 2023 (Discontinue)",
        "description": "Designed and implemented a freeroam gamemode with functional features and server-side configuration. Developed using PAWN scripting language for the SA-MP platform. The gamemode includes features such as vehicle spawning, player commands, weapon spawning, player teleport, vehicle customization, and more.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/GTA-SAMP-Simple-Freeroam-Gamemode"
    },
    {
        "title": "Car Rent Web App",
        "date": "Oct 2023 - Dec 2023",
        "description": "Developed front-end and back-end for a car rental information system as a database programming final project. Developed using PHP native and MySQL database.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/Sistem-Informasi-Rental-Mobil"
    },
    {
        "title": "Restaurant Web App",
        "date": "Nov 2023 - Dec 2023",
        "description": "Created menu display, search, and filter features for a restaurant ordering system using Laravel.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/Project-Akhir-PAW"
    },
    {
        "title": "Bansos House Eligibility Prediction",
        "date": "Nov 2024 - Dec 2024",
        "description": "This project aims to predict the eligibility of houses for social assistance (Bansos) based on images of their exteriors. Using a Convolutional Neural Network (CNN) model, the system classifies houses as either 'Eligible' or 'Not Eligible' for receiving social assistance. The model was trained on a dataset of house images labeled by eligibility status. The project was developed using Python and TensorFlow.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/Bansos-Eligibility-Prediction"
    },
    {
        "title": "Heal-in (REST API)",
        "date": "Feb 2024 - Mar 2024",
        "description": "Building fully functional RESTful API for app functionality and integration with MidTrans as Payment Gateway. Built using Golang.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/heal-in"
    },
    {
        "title": "Restologi (Mobile App)",
        "date": "Apr 2024 - Jun 2024",
        "description": "Design and build mobile app for food ordering on restaurant. Responsible for implementing payment and download feature. Design and build backend service for handling payment request and transaction.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/Restologi"
    },
    {
        "title": "Computy-AI Backend Service (REST API)",
        "date": "Sep 2024 - Nov 2024",
        "description": "Design and develop a REST API service using Golang for an AI-powered learning platform specializing in Computer Science. Integrating AI model to dynamically generate course based on user input. Implementing Redis and WebSocket. Responsible for creating comprehensive integration tests to ensure seamless interaction between backend services, AI model, and the database.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/"
    },
    {
        "title": "M&M Rental Backend Service (REST API)",
        "date": "Dec 2024 - Now",
        "description": "Design and develop REST API using Laravel to manage business functionality for a car rental platform. Implement robust admin and user functionalities, including vehicle management, reservation handling, and real-time data retrieval by category or status. Optimize system performance and security with middleware, validation, and role-based access control.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/M-M-Rental-Backend"
    },
    {
        "title": "Smart Lamp IoT System Using Blynk and ESP32",
        "date": "May 2024 - May 2024",
        "description": "Developed an IoT system that allows users to control a lamp remotely using the Blynk app. The system uses an ESP32 microcontroller to connect the lamp to the internet and receive commands from the Blynk app. I also integrated a light sensor and motion sensor to automate the lamp's operation based on ambient light levels and motion detection.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/IoT-Project"
    },
    {
        "title": "Hungarian Algorithm Implementation in Java",
        "date": "June 2023 - July 2023",
        "description": "Implemented the Hungarian Algorithm in Java to solve the assignment problem. The algorithm finds the optimal assignment of tasks to workers based on the cost of each assignment. The implementation includes a step-by-step explanation of the algorithm and a demonstration of its application to a sample problem.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/Hungarian-Algorithm-Java"
    },
    {
        "title": "Corner Sense",
        "date": "Nov 2023 - Dec 2023",
        "description": "Design and develop Java code implementation for a gaming center on my faculty. Our team designed a simple app called 'Corner Sense' to facilitate students in finding and booking gaming spots in the gaming center. The app allows users to view available spots, book a spot, and receive notifications when their booking is confirmed. The app also includes a feature to view the specifications of each gaming spot, such as the type of console available and the games installed.",
        "repositoryLink": "https://github.com/Syahreza-Ferdian/Corner-Sense"
    }
]